{
  "transcription": {
    "token_to_idx": {
      "<BLANK>": 0,
      "\"": 1,
      "%%": 2,
      "%%%": 3,
      "%%%%%": 4,
      "(": 5,
      "(:": 6,
      ")": 7,
      "*krussedull*": 8,
      "+": 9,
      ".": 10,
      "..": 11,
      "...": 12,
      "3": 13,
      ":": 14,
      ":)": 15,
      "<PAD>": 16,
      "<UNK>": 17,
      "=": 18,
      "@": 19,
      "Alkali": 20,
      "BallotScriptX": 21,
      "BigB": 22,
      "BigC": 23,
      "BigD": 24,
      "BigF": 25,
      "BigFire": 26,
      "BigG": 27,
      "BigH": 28,
      "BigInsularD": 29,
      "BigJ": 30,
      "BigK": 31,
      "BigL": 32,
      "BigM": 33,
      "BigN": 34,
      "BigP": 35,
      "BigQ": 36,
      "BigR": 37,
      "BigS": 38,
      "BigT": 39,
      "BigV": 40,
      "BigW": 41,
      "BigZ": 42,
      "CapitalGamma": 43,
      "CapitalLambda": 44,
      "CircledEquals": 45,
      "Cloud": 46,
      "Dagger": 47,
      "Dissolve": 48,
      "Dissolve_Square": 49,
      "Earth": 50,
      "Eye": 51,
      "Female": 52,
      "Fire": 53,
      "Infinity": 54,
      "InsularD": 55,
      "Integral": 56,
      "LatinLongLigatureFi": 57,
      "LatinSmallLigatureFi": 58,
      "NorthEastArrow": 59,
      "NotEqualTo": 60,
      "Pentagram": 61,
      "PhoenicianLetterPe": 62,
      "PlainBigL": 63,
      "RockSalt": 64,
      "Saturn": 65,
      "ScriptSmallG": 66,
      "ScriptSmallZ": 67,
      "SleepingSymbol": 68,
      "SmallDelta": 69,
      "SmallIota": 70,
      "SmallNHook": 71,
      "SmallPi": 72,
      "SquareP": 73,
      "SquaredPlus": 74,
      "SquaredRisingDiagonalSlash": 75,
      "TopHalfIntegral": 76,
      "TriangleDot": 77,
      "UpwardsArrow": 78,
      "VerticalLine": 79,
      "a": 80,
      "a^^": 81,
      "b": 82,
      "c": 83,
      "c^.": 84,
      "d": 85,
      "e": 86,
      "e?": 87,
      "e^^": 88,
      "f": 89,
      "g": 90,
      "gate": 91,
      "h": 92,
      "h^.": 93,
      "i": 94,
      "i^^": 95,
      "j": 96,
      "k": 97,
      "l": 98,
      "m": 99,
      "m^.": 100,
      "m__": 101,
      "n": 102,
      "n^.": 103,
      "n__": 104,
      "o": 105,
      "o^.": 106,
      "o^^": 107,
      "p": 108,
      "p^.": 109,
      "q": 110,
      "qua": 111,
      "r": 112,
      "r^.": 113,
      "r__": 114,
      "s": 115,
      "s^.": 116,
      "sci": 117,
      "t": 118,
      "u": 119,
      "u^^": 120,
      "u__": 121,
      "v": 122,
      "w": 123,
      "x": 124,
      "x^.": 125,
      "y": 126,
      "y^..": 127,
      "z": 128,
      "{": 129,
      "}": 130,
      "< SOS >": 131,
      "<EOS>": 132
    },
    "idx_to_token": {
      "0": "<BLANK>",
      "1": "\"",
      "2": "%%",
      "3": "%%%",
      "4": "%%%%%",
      "5": "(",
      "6": "(:",
      "7": ")",
      "8": "*krussedull*",
      "9": "+",
      "10": ".",
      "11": "..",
      "12": "...",
      "13": "3",
      "14": ":",
      "15": ":)",
      "16": "<PAD>",
      "17": "<UNK>",
      "18": "=",
      "19": "@",
      "20": "Alkali",
      "21": "BallotScriptX",
      "22": "BigB",
      "23": "BigC",
      "24": "BigD",
      "25": "BigF",
      "26": "BigFire",
      "27": "BigG",
      "28": "BigH",
      "29": "BigInsularD",
      "30": "BigJ",
      "31": "BigK",
      "32": "BigL",
      "33": "BigM",
      "34": "BigN",
      "35": "BigP",
      "36": "BigQ",
      "37": "BigR",
      "38": "BigS",
      "39": "BigT",
      "40": "BigV",
      "41": "BigW",
      "42": "BigZ",
      "43": "CapitalGamma",
      "44": "CapitalLambda",
      "45": "CircledEquals",
      "46": "Cloud",
      "47": "Dagger",
      "48": "Dissolve",
      "49": "Dissolve_Square",
      "50": "Earth",
      "51": "Eye",
      "52": "Female",
      "53": "Fire",
      "54": "Infinity",
      "55": "InsularD",
      "56": "Integral",
      "57": "LatinLongLigatureFi",
      "58": "LatinSmallLigatureFi",
      "59": "NorthEastArrow",
      "60": "NotEqualTo",
      "61": "Pentagram",
      "62": "PhoenicianLetterPe",
      "63": "PlainBigL",
      "64": "RockSalt",
      "65": "Saturn",
      "66": "ScriptSmallG",
      "67": "ScriptSmallZ",
      "68": "SleepingSymbol",
      "69": "SmallDelta",
      "70": "SmallIota",
      "71": "SmallNHook",
      "72": "SmallPi",
      "73": "SquareP",
      "74": "SquaredPlus",
      "75": "SquaredRisingDiagonalSlash",
      "76": "TopHalfIntegral",
      "77": "TriangleDot",
      "78": "UpwardsArrow",
      "79": "VerticalLine",
      "80": "a",
      "81": "a^^",
      "82": "b",
      "83": "c",
      "84": "c^.",
      "85": "d",
      "86": "e",
      "87": "e?",
      "88": "e^^",
      "89": "f",
      "90": "g",
      "91": "gate",
      "92": "h",
      "93": "h^.",
      "94": "i",
      "95": "i^^",
      "96": "j",
      "97": "k",
      "98": "l",
      "99": "m",
      "100": "m^.",
      "101": "m__",
      "102": "n",
      "103": "n^.",
      "104": "n__",
      "105": "o",
      "106": "o^.",
      "107": "o^^",
      "108": "p",
      "109": "p^.",
      "110": "q",
      "111": "qua",
      "112": "r",
      "113": "r^.",
      "114": "r__",
      "115": "s",
      "116": "s^.",
      "117": "sci",
      "118": "t",
      "119": "u",
      "120": "u^^",
      "121": "u__",
      "122": "v",
      "123": "w",
      "124": "x",
      "125": "x^.",
      "126": "y",
      "127": "y^..",
      "128": "z",
      "129": "{",
      "130": "}",
      "131": "< SOS >",
      "132": "<EOS>"
    },
    "vocab_size": 133
  },
  "plaintext": {
    "char_to_idx": {
      "<PAD>": 0,
      "< SOS >": 1,
      "<EOS>": 2,
      "<UNK>": 3,
      " ": 4,
      "A": 5,
      "B": 6,
      "C": 7,
      "D": 8,
      "E": 9,
      "F": 10,
      "G": 11,
      "H": 12,
      "I": 13,
      "J": 14,
      "K": 15,
      "L": 16,
      "M": 17,
      "N": 18,
      "O": 19,
      "P": 20,
      "R": 21,
      "S": 22,
      "T": 23,
      "U": 24,
      "V": 25,
      "W": 26,
      "X": 27,
      "Y": 28,
      "Z": 29,
      "a": 30,
      "b": 31,
      "c": 32,
      "d": 33,
      "e": 34,
      "f": 35,
      "g": 36,
      "h": 37,
      "i": 38,
      "j": 39,
      "k": 40,
      "l": 41,
      "m": 42,
      "n": 43,
      "o": 44,
      "p": 45,
      "r": 46,
      "s": 47,
      "t": 48,
      "u": 49,
      "v": 50,
      "w": 51,
      "x": 52,
      "y": 53,
      "z": 54,
      "\"": 55,
      ")": 56,
      ".": 57,
      ":": 58,
      "?": 59,
      "@": 60,
      "q": 61,
      "{": 62,
      "}": 63,
      "\u00e4": 64,
      "\u00f6": 65,
      "\u00fc": 66
    },
    "idx_to_char": {
      "0": "<PAD>",
      "1": "< SOS >",
      "2": "<EOS>",
      "3": "<UNK>",
      "4": " ",
      "5": "A",
      "6": "B",
      "7": "C",
      "8": "D",
      "9": "E",
      "10": "F",
      "11": "G",
      "12": "H",
      "13": "I",
      "14": "J",
      "15": "K",
      "16": "L",
      "17": "M",
      "18": "N",
      "19": "O",
      "20": "P",
      "21": "R",
      "22": "S",
      "23": "T",
      "24": "U",
      "25": "V",
      "26": "W",
      "27": "X",
      "28": "Y",
      "29": "Z",
      "30": "a",
      "31": "b",
      "32": "c",
      "33": "d",
      "34": "e",
      "35": "f",
      "36": "g",
      "37": "h",
      "38": "i",
      "39": "j",
      "40": "k",
      "41": "l",
      "42": "m",
      "43": "n",
      "44": "o",
      "45": "p",
      "46": "r",
      "47": "s",
      "48": "t",
      "49": "u",
      "50": "v",
      "51": "w",
      "52": "x",
      "53": "y",
      "54": "z",
      "55": "\"",
      "56": ")",
      "57": ".",
      "58": ":",
      "59": "?",
      "60": "@",
      "61": "q",
      "62": "{",
      "63": "}",
      "64": "\u00e4",
      "65": "\u00f6",
      "66": "\u00fc"
    },
    "vocab_size": 67
  }
}